{
	"General": "[font_size={32}][b]General[/b][/font_size]\n[p]Welcome to Cardet.[/p]\n[p]The goal of this game is just to complete all the levels by defeating all the enemy waves in the level, simple right?[/p]\n[p]Main problem is that most level doesn't provide enough resource to beat the level within the level.[/p]\n[p]To fix that issue we can create decks from completing easier level and bring those unit into the harder levels.[/p]\n[p]Slowly strengthen the deck and face tougher and tougher levels.[/p]\n[p]This information page is to help clarify on the details of the game as much as possible.[/p]\n[p]If you have any questions on what something does in game just consult this information page.[/p]\n[p]Following is the brief explaination of each of the category and what each category covers briefly.[/p]\n[font_size={20}][b][url=Levels]Levels[/url][/b][/font_size]\n[p]Details on the information of the level select and level themselves.[/p]\n[font_size={20}][b][url=Unit]Unit[/url][/b][/font_size]\n[p]Details on the unit cards and the stats of the unit.[/p]\n[font_size={20}][b][url=Deck]Deck[/url][/b][/font_size]\n[p]Details on the deck and various deck tools.[/p]\n[font_size={20}][b][url=Resources]Resources[/url][/b][/font_size]\n[p]Details on the resources, where to get them and what they are used for.[/p]",
	"Levels": "[font_size={32}][b]Levels[/b][/font_size]\n[p]The game is broken into various levels each with their own challenges and layout.[/p]\n[p]At the level select screen you can choose what level to enter.[/p]\n[p]Most levels are locked at first, you need to complete a previous level to unlock the next one. Sometimes you can unlock multiple levels from completing a level.[/p]\n[p](As of v0.0.1 there is only the tutorial level and a blocked level, more coming later).[/p]\n[p]On level select screen you can manage your [url=Deck]Deck[/url], check that category for more details.[/p]\n[p]Within each level you can move around the level by using wasd and zoom in and out using + and -.[/p]\n[p]Level will have set enemy placement as well as some special buildings such as shop and stuff.[/p]\n[p]Each level will have a starting camp which acts as a starting shop.[/p]\n[p]If you are stuck on a level, you can forfeit the level by selecting forfeit in the menu bar on the top right. This will count as failing the level so it won't unlock the next level.[/p]",
	"Unit": "[font_size={32}][b]Unit[/b][/font_size]\n[p]Unit in this game refers to all unit and building of both the player and the enemy.[/p]\n[p]Player unit can be rotated using the q and e key, the range will change respective to the rotation.[/p]\n[p]Following are details on the various stats a unit and what they mean and some examples of them.[/p]\n[font_size={20}][b]Health[/b][/font_size]\n[p]Now for health it is divided into max health and health. Max health refers to the maximum health a unit can have. Even if the unit get healed it cannot surpass this number. Health refers to the unit's current health. When this drops to zero and below, the unit dies.[/p]\n[font_size={20}][b]Attack[/b][/font_size]\n[p]Attack is the damage it does to unit within their range at the end of turn. Generally, player unit will deal damage before the enemy unit unless specified otherwise.[/p]\n[font_size={20}][b]Range[/b][/font_size]\n[p]Effective range of the unit. Unit can only attack or heal unit within its range. Shops will give a brief description on the range (although I would like to give a tiny preview of the range later). [/p]\n[p]When viewing the attack range on the board bright red squares means square the unit is currently targetting while dark red squares means squares within range but not currently targetting.[/p]\n[font_size={20}][b]Special Effect[/b][/font_size]\n[p]Effect that happens constantly. Example being splash means all attack from this unit will have additional splash effect, thorn being all unit that does damage to this unit takes damage (might want to exclude range unit when implemeting this), speedy enemy can enemy unit move first, etc.[/p]\n[font_size={20}][b]On First Turn Effect[/b][/font_size]\n[p]Effect that happens on the first turn the unit is deployed. For player, it means the turn when the unit would regularly be locked in place. For enemies, it means the turn when the unit is revealed from under the fog. Great for enemy jump scare if you ask me. Happens after damage step so unit can die before this effect is triggered.[/p]\n[font_size={20}][b]On Death Effect[/b][/font_size]\n[p]Effect that happens when a unit dies. This can range from it becoming another unit, doing some damage to unit in a certain range, giving buff to unit in a certain range, adding card to player's hand, drop gold and other currency, etc.[/p]\n[p](A lot of this has not yet been implemented but this leaves a lot of variety as to what the units can do later).[/p]\n[font_size={20}][b]On Turn Effect[/b][/font_size]\n[p]Effect that happens during end of turn. Happens after damage step so unit can die before this effect is triggered. This effect can do thing such as bouncing the card back to player's hand, prevent the unit from being locked, becoming other unit, etc.[/p]\n[font_size={20}][b]On Kill Effect[/b][/font_size]\n[p]Effect that happens when an opposing unit is killed.[/p]\n[p](While I initially want to do it in the way where the unit with this effect must get the last hit, the order the unit move is a bit not that great for that idea right now (currently player unit move by the order the card is placed on the board and enemy move by the order that they are loaded into the game). Maybe if I implement a speed stat or something to be able to order unit move order better I can change it but for now it is what it is.[/p]\n[font_size={20}][b]On All Kill Effect[/b][/font_size]\n[p]Effect that happens when any unit is killed, doesn't matter from which side.[/p]\n[font_size={20}][b]On Victory Effect - Player only[/b][/font_size]\n[p]Effect that happens after an enemy wave has been cleared and some fog have cleared up. Can do similar thing to other effect.[/p]\n[p](Do note that due to the way this triggers, only player unit will be able to have this effect).[/p]\n[font_size={20}][b]On Completion Effect - Player only[/b][/font_size]\n[p]Effect that happens when the map is cleared. Generally is for displaying what it will add to the deck when map is complete.[/p]\n[font_size={20}][b]On Hand Completion Effect - Player only[/b][/font_size]\n[p]Effect that happens to unit in hand when the map is cleared. If it doesn't display this it will apply the on completion effect instead.[/p]\n[font_size={20}][b]On Failed Effect - Player only[/b][/font_size]\n[p]Effect that happens to unit in hand when player failed the map. Also displays what will be added to the deck but follow a different card set.[/p]\n[font_size={20}][b]Unit Flow Chart[/b][/font_size]\n[p]Here is a simple flow chart for what the the unit turns into base on their effects as of version 0.0.1[/p]\n[img=688]res://image/UnitFlowChart_v0.0.1.png[/img]",
	"Deck": "[font_size={32}][b]Deck[/b][/font_size]\n[p]On completing or failing a map you get a deck base on your hand and unit on the board at that moment. What each unit will do will be based on their on completion, on hand completion, and failed effect. Usually the on failed effect will be weaker than the on completion effects, so do attempt to complete the map if possible.[/p]\n[p]Decks can only be used on level with deck slot. Drag the deck to the level will put that deck in the deck slot. Clicking on it will return it to your hand. Decks put in deck slots of level you did not select will automatically be returned.[/p]\n[p]In general, most of the special resource is only produce by these deck unit. For detail on the resources check out the [url=Resources]Resources[/url] category.[/p]\n[p]You can also sometimes get deck tools from levels.[/p]\n[p]These functions as deck upgrade that can be used on decks on the level select. They have limited use so Following are some of the common ones.[/p]\n[font_size={20}][b]Combiner[/b][/font_size]\n[p]A deck combiner, combines an amount (2 or more) of decks together as one deck without changing the content within the deck.[/p]\n[p]Makes it so that you can bring more cards into a level with few deck slots.[/p]\n[font_size={20}][b]Duplicator[/b][/font_size]\n[p]A deck duplicator, duplicates a deck of limited size (based on card amount in the deck).[/p]\n[p]Reduce grind of old levels and provide backup in case you failed the level.[/p]\n[font_size={20}][b]Resource[/b][/font_size]\n[p]Add some resource to a selected deck.[/p]\n[font_size={20}][b]Upgrader[/b][/font_size]\n[p]Upgrade certain unit within the selected deck.[/p]\n[p]Can range from one type of unit, building unit, all regular unit, special unit, etc. and provide effect such as changing them to other unit, boost stat of unit, trigger on completion or on hand completion effect of the unit, etc.[/p]",
	"Resources": "[font_size={32}][b]Resources[/b][/font_size]\n[p]Different resources within this game. To obtain them usually and what they are mostly used for.[/p]\n[font_size={20}][b]Gold[/b][/font_size]\n[p]The general currency receive from everything from killing enemy unit to some player units' effect.[/p]\n[p]Typically each level has a starting amount of gold as well. If a deck is used, the amount in the deck is added on to the starting amount of the level.[/p]\n[p]Used for everything.[/p]\n[font_size={20}][b]Supply[/b][/font_size]\n[p]The general currency that is generally produced by building units.[/p]\n[p]Used item and unit purchase generally.[/p]\n[font_size={20}][b]Honour[/b][/font_size]\n[p]Generally received from human unit from on map completion.[/p]\n[p]Used for hero unit production and hero unit upgrade.[/p]\n[font_size={20}][b]Research[/b][/font_size]\n[p]Generally received from building unit from on map completion.[/p]\n[p]Used for special building and item production and could be used to provide general upgrade to all units.[/p]\n[font_size={20}][b]Soul[/b][/font_size]\n[p]Generally received from human unit that died and some unit on map failure.[/p]\n[p]Used for hero resurrection and some unit production.[/p]\n[font_size={20}][b]Scrap[/b][/font_size]\n[p]Generally received from building unit that were destroyed and some building unit on map failure.[/p]\n[p]Used for special building reconstruction and some unit production.[/p]"
}
