{
	"Unit": "[font_size={32}][b]Unit[/b][/font_size]\n[p]Unit in this game refers to all unit and building of both the player and the enemy. Following are details on the various stats a unit and what they mean and some examples of them.[/p]\n[font_size={20}][b]Health[/b][/font_size]\n[p]Now for health it is divided into max health and health. Max health refers to the maximum health a unit can have. Even if the unit get healed it cannot surpass this number. Health refers to the unit's current health. When this drops to zero and below, the unit dies.[/p]\n[font_size={20}][b]Attack[/b][/font_size]\n[p]Attack is the damage it does to unit within their range at the end of turn. Generally, player unit will deal damage before the enemy unit unless specified otherwise.[/p]\n[font_size={20}][b]Range[/b][/font_size]\n[p]Effective range of the unit. Unit can only attack or heal unit within its range. Shops will give a brief description on the range (although I would like to give a tiny preview of the range later). [/p]\n[p]When viewing the attack range on the board bright red squares means square the unit is currently targetting while dark red squares means squares within range but not currently targetting.[/p]\n[font_size={20}][b]Special Effect[/b][/font_size]\n[p]Effect that happens constantly. Example being splash means all attack from this unit will have additional splash effect, thorn being all unit that does damage to this unit takes damage (might want to exclude range unit when implemeting this), speedy enemy can enemy unit move first, etc.[/p]\n[font_size={20}][b]On First Turn Effect[/b][/font_size]\n[p]Effect that happens on the first turn the unit is deployed. For player, it means the turn when the unit would regularly be locked in place. For enemies, it means the turn when the unit is revealed from under the fog. Great for enemy jump scare if you ask me. Happens after damage step so unit can die before this effect is triggered.[/p]\n[font_size={20}][b]On Death Effect[/b][/font_size]\n[p]Effect that happens when a unit dies. This can range from it becoming another unit, doing some damage to unit in a certain range, giving buff to unit in a certain range, adding card to player's hand, drop gold and other currency, etc.[/p]\n[p](A lot of this has not yet been implemented but this leaves a lot of variety as to what the units can do later).[/p]\n[font_size={20}][b]On Turn Effect[/b][/font_size]\n[p]Effect that happens during end of turn. Happens after damage step so unit can die before this effect is triggered. This effect can do thing such as bouncing the card back to player's hand, prevent the unit from being locked, becoming other unit, etc.[/p]\n[font_size={20}][b]On Kill Effect[/b][/font_size]\n[p]Effect that happens when an opposing unit is killed.[/p]\n[p](While I initially want to do it in the way where the unit with this effect must get the last hit, the order the unit move is a bit not that great for that idea right now (currently player unit move by the order the card is placed on the board and enemy move by the order that they are loaded into the game). Maybe if I implement a speed stat or something to be able to order unit move order better I can change it but for now it is what it is.[/p]\n[font_size={20}][b]On All Kill Effect[/b][/font_size]\n[p]Effect that happens when any unit is killed, doesn't matter from which side.[/p]\n[font_size={20}][b]On Victory Effect - Player only[/b][/font_size]\n[p]Effect that happens after an enemy wave has been cleared and some fog have cleared up. Can do similar thing to other effect.[/p]\n[p](Do note that due to the way this triggers, only player unit will be able to have this effect).[/p]\n[font_size={20}][b]On Completion Effect - Player only[/b][/font_size]\n[p]Effect that happens when the map is cleared. Generally is for displaying what it will add to the deck when map is complete.[/p]\n[font_size={20}][b]On Hand Completion Effect - Player only[/b][/font_size]\n[p]Effect that happens to unit in hand when the map is cleared. If it doesn't display this it will apply the on completion effect instead.[/p]\n[font_size={20}][b]On Failed Effect - Player only[/b][/font_size]\n[p]Effect that happens to unit in hand when player failed the map. Also displays what will be added to the deck but follow a different card set.[/p]",
	"Deck": ""
}
