{
	"1": {
		"type": "normal",
		"text": "Welcome to Cardet, the objective of this game is simple. Just simply get to the end portal."
	},
	"2": {
		"type": "pointer",
		"text": "In order to do that, you must defeat enemies on the map in order to uncover more of the fog.",
		"pointers": ["MapGrid/GridNode12", "MapGrid/GridNode13", "MapGrid/GridNode14"]
	},
	"3": {
		"type": "action",
		"text": "Click on the camp to buy units.",
		"pointers": ["MapGrid/GridNode28"]
	},
	"4": {
		"type": "normal",
		"text": "Shops have different items in stock base on the level and type of shop."
	},
	"5": {
		"type": "action",
		"text": "Click on the first unit unit on the shop.",
		"pointers": ["Popup/ShopMenu/ShopItems/RowContainer/ItemSlot"]
	},
	"6": {
		"type": "pointer",
		"text": "All the detail of the unit is displayed the the text box below.",
		"pointers": ["Popup/ShopMenu/SelectedItem/ItemDetail"]
	},
	"7": {
		"type": "normal",
		"text": "Quick explaination of what all the details:\nHealth is the max health of the unit, when health reach 0 the unit dies.\nAttack is damage the unit does to enemy unit within range.\nRange briefly explain the attack range of the unit.\nDeath effect briefly describe what the unit does when the unit dies.\nVictory effect briefly describe what the unit does when a wave of enemy is defeated.\nCost being cost to buy the unit."
	},
	"8": {
		"type": "pointer",
		"text": "You can review what each stat does in the info section found in the menu.",
		"pointers": ["CanvasLayer/PlayerUI/TopBar/Menu"]
	},
	"9": {
		"type": "action",
		"text": "Now buy the unit from the shop.",
		"pointers": ["Popup/ShopMenu/SelectedItem/ItemDetail/BuyItem/Buy"]
	},
	"10": {
		"type": "action",
		"text": "Exit out of the shop by clicking outside the shop menu.",
		"pointers": ["Popup/ShopMenu"],
		"wait-for-exit": 0
	},
	"11": {
		"type": "normal",
		"text": "The unit have been added to our hand as a card now.\nHovering over the card will raise the card up allowing you to review the detail of the unit.",
	},
	"12": {
		"type": "normal",
		"text": "You move unit by clicking and dragging the unit unto the board."
	},
	"13": {
		"type": "normal",
		"text": "Hovering over a unit will display its range as red border as well as brief detail on its health and attack.\nClicking on them will bring out an info box on more detail of the selected unit."
	},
	"14": {
		"type": "normal",
		"text": "Unit on the board can be dragged unto any valid square.\nIf dragged unto another unit that can be moved they will switch place.\nThey can also be rotated with q and e key to face different location.\nDragging the unit to the bottom of the screen will return them to your hand."
	},
	"15": {
		"type": "action",
		"text": "Place the unit in a square and click next turn.",
		"pointers": ["CanvasLayer/PlayerUI/NextTurn"]
	},
	"16": {
		"type": "normal",
		"text": "In between each turn the unit will deal damage to all enemy within their range.\nWith your unit attacking before the enemy unit unless specified otherwise."
	},
	"17": {
		"type": "normal",
		"text": "Also note that all unit played are locked in place upon clicking next turn as indicated by the grey border.\nThe unit won't be able to be moved again unless some kind of effect removes it effectively locking out this space.\nSo be resourceful with the space given."
	},
	"18": {
		"type": "action",
		"text": "Continue until all unit is dead.",
		"pointers": ["MapGrid/GridNode12/Content/Enemy", "MapGrid/GridNode13/Content/Enemy", "MapGrid/GridNode14/Content/Enemy"],
		"wait-for-exit": 0
	},
	"19": {
		"type": "pointer",
		"text": "Upon defeating the enemy wave, some of the fog clears up revealing what is under it.",
		"pointers": ["MapGrid/GridNode7", "MapGrid/GridNode8", "MapGrid/GridNode9"]
	},
	"20": {
		"type": "normal",
		"text": "Note that if there are enemies under the fog they are inactive until revealed,\nso you don't have to worry about attack coming from no where."
	},
	"21": {
		"type": "pointer",
		"text": "This is an end portal. Which indicate an end of the level.",
		"pointers": ["MapGrid/GridNode8"]
	},
	"22": {
		"type": "normal",
		"text": "Upon completing the level your hand, board, and resource count will be made into a deck\nthat can be used on other levels, but only on levels with deck slots."
	},
	"23": {
		"type": "normal",
		"text": "Failing a level will also create a deck base on your board state,\nbut in general a successful run will produce better decks."
	},
	"24": {
		"type": "pointer",
		"text": "For more detail explaination of the deck mechanic refer to the info section in the menu.",
		"pointers": ["CanvasLayer/PlayerUI/TopBar/Menu"]
	},
	"25": {
		"type": "action",
		"text": "Now click on the portal to complete the tutorial.",
		"pointers": ["MapGrid/GridNode8"]
	}
}
